<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"786c9f3e772b17c23d05b289023bc4656a028dc2b2b7d9c18784930225c8c343","plan_job_ref":"Job terraform plan #93 at https://github.com/suzutan/infra/actions/runs/14009197081","plan_out_hash":"25237447577d20628ffef40437a876fd6828bffa4e0f703fd43e9e456a46433e","plan_hash":"f203403da8900046055bcee85cf92f6fd3c44ec1fc02f437c9e62b44471577cc","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 4 to add, 15 to change, 4 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_dns_record.k8s_ingress["argocd.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "k8s_ingress" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "aea7e7f5-2da4-4ee6-9cf9-73a29e70a264.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "f2d5124ee90047c4a6f4d51ee91758b9"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
        name                = "argocd.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.k8s_ingress["asf.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "k8s_ingress" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "aea7e7f5-2da4-4ee6-9cf9-73a29e70a264.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "e5730c0eba9881d09ae002b7a1e24bbd"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
        name                = "asf.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.k8s_ingress["echoserver.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "k8s_ingress" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "aea7e7f5-2da4-4ee6-9cf9-73a29e70a264.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "8ab148cd315cb794ae0a451d3d12aaef"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
        name                = "echoserver.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.k8s_ingress["id.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "k8s_ingress" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "aea7e7f5-2da4-4ee6-9cf9-73a29e70a264.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "443e67e5a0799575146be660e5bd508a"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
        name                = "id.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.k8s_ingress["influxdb2.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "k8s_ingress" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "aea7e7f5-2da4-4ee6-9cf9-73a29e70a264.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "5d19ed418818303e13f02f00321ae82b"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
        name                = "influxdb2.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.k8s_ingress["navidrome-filebrowser.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "k8s_ingress" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "aea7e7f5-2da4-4ee6-9cf9-73a29e70a264.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "a82b6f4da95b6e02c8a685f72fce4608"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
        name                = "navidrome-filebrowser.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.k8s_ingress["navidrome.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "k8s_ingress" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "aea7e7f5-2da4-4ee6-9cf9-73a29e70a264.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "642f7c8f5131a5848d51212920688cc0"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
        name                = "navidrome.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.metrics["grafana.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "metrics" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "cfff2a49-c9fc-4675-8bcb-c29716fb441f.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:06Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "b5922ffac1ff13110d4479a82591bc82"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:06Z" -> (known after apply)
        name                = "grafana.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_dns_record.metrics["prometheus.harvestasya.org"] will be updated in-place
!~  resource "cloudflare_dns_record" "metrics" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "cfff2a49-c9fc-4675-8bcb-c29716fb441f.cfargotunnel.com" -> (known after apply)
!~      created_on          = "2025-03-09T14:39:06Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "614550330884bcf9e43d66158b7dbd89"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:06Z" -> (known after apply)
        name                = "prometheus.harvestasya.org"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.k8s_ingress must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared" "k8s_ingress" {
!~      account_tag       = "3b433b4bc6b6f9770dbf88886748ec8b" -> (known after apply)
+       config_src        = "local" # forces replacement
!~      connections       = [
-           {
-               client_id            = "743a4378-dae3-4cd2-b8a1-40d4694f64fa" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt08" -> null
-               id                   = "2269fa60-b032-4517-a3b1-9cc0c4e7bfbe" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:20Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "2269fa60-b032-4517-a3b1-9cc0c4e7bfbe" -> null
            },
-           {
-               client_id            = "743a4378-dae3-4cd2-b8a1-40d4694f64fa" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt09" -> null
-               id                   = "a6904758-2453-42e1-ab4f-39bf1f13705e" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:20Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "a6904758-2453-42e1-ab4f-39bf1f13705e" -> null
            },
-           {
-               client_id            = "743a4378-dae3-4cd2-b8a1-40d4694f64fa" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt07" -> null
-               id                   = "5f0452ea-bf0a-4bc9-b412-310fefacba6f" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:21Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "5f0452ea-bf0a-4bc9-b412-310fefacba6f" -> null
            },
-           {
-               client_id            = "743a4378-dae3-4cd2-b8a1-40d4694f64fa" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt09" -> null
-               id                   = "d1f0c55b-b9cf-4fba-b7a2-fe40e5eff5a5" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:22Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "d1f0c55b-b9cf-4fba-b7a2-fe40e5eff5a5" -> null
            },
-           {
-               client_id            = "888a16cb-f924-483d-869b-2fd1c1220ed4" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt08" -> null
-               id                   = "09a3e85c-a778-457d-9e6b-0011bbf3a215" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:13Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "09a3e85c-a778-457d-9e6b-0011bbf3a215" -> null
            },
-           {
-               client_id            = "888a16cb-f924-483d-869b-2fd1c1220ed4" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt12" -> null
-               id                   = "3be86895-95ee-41f3-83db-a6cfb2d611f7" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:13Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "3be86895-95ee-41f3-83db-a6cfb2d611f7" -> null
            },
-           {
-               client_id            = "888a16cb-f924-483d-869b-2fd1c1220ed4" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt08" -> null
-               id                   = "f4349387-a65a-4dcc-8275-54ece04b2edb" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:14Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "f4349387-a65a-4dcc-8275-54ece04b2edb" -> null
            },
-           {
-               client_id            = "888a16cb-f924-483d-869b-2fd1c1220ed4" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt01" -> null
-               id                   = "c805887c-816a-47b6-b29d-f6bd0b4fd041" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:03:15Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "c805887c-816a-47b6-b29d-f6bd0b4fd041" -> null
            },
        ] -> (known after apply)
!~      conns_active_at   = "2025-03-21T06:03:13Z" -> (known after apply)
+       conns_inactive_at = (known after apply)
!~      created_at        = "2025-03-09T14:39:05Z" -> (known after apply)
+       deleted_at        = (known after apply)
!~      id                = "************************************" -> (known after apply)
!~      metadata          = jsonencode({}) -> (known after apply)
        name              = "k8s-ingress"
!~      remote_config     = true -> (known after apply)
!~      status            = "healthy" -> (known after apply)
!~      tun_type          = "cfd_tunnel" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.metrics must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared" "metrics" {
!~      account_tag       = "3b433b4bc6b6f9770dbf88886748ec8b" -> (known after apply)
+       config_src        = "local" # forces replacement
!~      connections       = [
-           {
-               client_id            = "320f4427-47e9-4a6d-a76e-7bc18da78279" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt09" -> null
-               id                   = "ec76bf5f-9f30-44ee-9b46-7c45a24f46db" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:02:45Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "ec76bf5f-9f30-44ee-9b46-7c45a24f46db" -> null
            },
-           {
-               client_id            = "320f4427-47e9-4a6d-a76e-7bc18da78279" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt07" -> null
-               id                   = "cc6a0958-b02f-4324-80b7-ba45700dadc6" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:02:45Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "cc6a0958-b02f-4324-80b7-ba45700dadc6" -> null
            },
-           {
-               client_id            = "320f4427-47e9-4a6d-a76e-7bc18da78279" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt09" -> null
-               id                   = "ed7fb255-5faa-4f7d-91ee-b1bd97b3f9a3" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:02:46Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "ed7fb255-5faa-4f7d-91ee-b1bd97b3f9a3" -> null
            },
-           {
-               client_id            = "320f4427-47e9-4a6d-a76e-7bc18da78279" -> null
-               client_version       = "2025.2.1" -> null
-               colo_name            = "nrt07" -> null
-               id                   = "8e9111b9-7519-41bc-8532-3229630aa361" -> null
-               is_pending_reconnect = false -> null
-               opened_at            = "2025-03-21T06:02:47Z" -> null
-               origin_ip            = "14.8.27.37" -> null
-               uuid                 = "8e9111b9-7519-41bc-8532-3229630aa361" -> null
            },
        ] -> (known after apply)
!~      conns_active_at   = "2025-03-21T06:02:45Z" -> (known after apply)
+       conns_inactive_at = (known after apply)
!~      created_at        = "2025-03-09T14:39:05Z" -> (known after apply)
+       deleted_at        = (known after apply)
!~      id                = "************************************" -> (known after apply)
!~      metadata          = jsonencode({}) -> (known after apply)
        name              = "metrics-ingress"
!~      remote_config     = true -> (known after apply)
!~      status            = "healthy" -> (known after apply)
!~      tun_type          = "cfd_tunnel" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress        = [
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
+                   origin_request = (known after apply)
#                    (2 unchanged attributes hidden)
                },
            ]
+           origin_request = (known after apply)
!~          warp_routing   = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-03-09T15:59:30Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      source     = "cloudflare" -> "local"
!~      tunnel_id  = "************************************" -> (known after apply) # forces replacement
!~      version    = 4 -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.metrics must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "metrics" {
!~      config     = {
!~          ingress        = [
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
!~                  origin_request = {
+                       access                 = (known after apply)
#                        (11 unchanged attributes hidden)
                    }
#                    (3 unchanged attributes hidden)
                },
!~              {
+                   origin_request = (known after apply)
#                    (2 unchanged attributes hidden)
                },
            ]
+           origin_request = (known after apply)
!~          warp_routing   = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-03-09T15:59:30Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply)
!~      source     = "cloudflare" -> "local"
!~      tunnel_id  = "************************************" -> (known after apply) # forces replacement
!~      version    = 2 -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_1 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_1" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "f938c55afcc58eddc6c29cdf43ab5b0d"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "fm1._domainkey.harvestasya.org" -> "fm1._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_2 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_2" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "63d7a93d4c4f663e4778444f2429008f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "fm2._domainkey.harvestasya.org" -> "fm2._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_3 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_3" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "99aa31b80dc1647ae04b0577b6b8817a"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "fm3._domainkey.harvestasya.org" -> "fm3._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.mx_0 will be updated in-place
!~  resource "cloudflare_dns_record" "mx_0" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "88df54f011e43b8cd63fe2af3d87ac90"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "harvestasya.org" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.mx_1 will be updated in-place
!~  resource "cloudflare_dns_record" "mx_1" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "f1e2153c963f2c51a0b70a23de360a05"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "harvestasya.org" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.spf will be updated in-place
!~  resource "cloudflare_dns_record" "spf" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T14:39:05Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "3ea3655515aa129005268d46d520f4df"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T14:39:05Z" -> (known after apply)
!~      name                = "harvestasya.org" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 4 to add, 15 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #93](https://github.com/suzutan/infra/actions/runs/14009197081)